In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
import time
import geopandas as gpd

In [48]:
dataset_path = "datasets/"
test_image_output_path = "test_image_outputs/"
master_datasets_path = "master_datasets/"
old_code_path = "old_code/"
code_path = "code/"

In [49]:
sea_df = pd.read_csv('master_datasets/sea_levels.csv')
sea_df.head()

         Time   GMSL  GMSL uncertainty
0  1880-01-15 -183.0              24.2
1  1880-02-15 -171.1              24.2
2  1880-03-15 -164.3              24.2
3  1880-04-15 -158.2              24.2
4  1880-05-15 -158.7              24.2

In [50]:
sea_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1608 entries, 0 to 1607
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Time              1608 non-null   object
 1   GMSL              1608 non-null   float64
 2   GMSL uncertainty  1608 non-null   float64
dtypes: float64(2), object(1)
memory usage: 37.8+ KB

In [51]:
sea_df.columns

Index(['Time', 'GMSL', 'GMSL uncertainty'], dtype='object')

In [52]:
sea_df = sea_df[['Time','GMSL']]
sea_df.head()

         Time   GMSL
0  1880-01-15 -183.0
1  1880-02-15 -171.1
2  1880-03-15 -164.3
3  1880-04-15 -158.2
4  1880-05-15 -158.7

In [53]:
sea_df.rename(columns = {'Time':'Date', 'GMSL':'Global_mean_sea_levels'}, 
               inplace = True)
sea_df.head()

         Date  Global_mean_sea_levels
0  1880-01-15                  -183.0
1  1880-02-15                  -171.1
2  1880-03-15                  -164.3
3  1880-04-15                  -158.2
4  1880-05-15                  -158.7

In [54]:
sea_df.tail()

            Date  Global_mean_sea_levels
1603  2013-08-15                    71.6
1604  2013-09-15                    68.8
1605  2013-10-15                    66.4
1606  2013-11-15                    59.7
1607  2013-12-15                    58.5

In [55]:
sea_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1608 entries, 0 to 1607
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1608 non-null   object
 1   Global_mean_sea_levels  1608 non-null   float64
dtypes: float64(1), object(1)
memory usage: 25.2+ KB

In [56]:
sea_df.Date = pd.to_datetime(sea_df.Date)
sea_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1608 entries, 0 to 1607
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1608 non-null   datetime64[ns]
 1   Global_mean_sea_levels  1608 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 25.2 KB

In [57]:
sea_df.Date.min()

Timestamp('1880-01-15 00:00:00')

In [58]:
sea_df.Date.max()

Timestamp('2013-12-15 00:00:00')

In [59]:
from datetime import date
from itertools import product

y = np.arange(1850,1880)
d = [15]
m = np.arange(1,13)
cols = ['Year','Month','Day']
before_year_list = pd.DataFrame(list(product(y, m, d)), columns=cols)

DATE = []
for y, m in zip(before_year_list.Year, before_year_list.Month):
    DATE.append(date(y, m, 15))


before_year_list['Date'] = DATE
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    360 non-null    int64
 1   Month   360 non-null    int64
 2   Day     360 non-null    int64
 3   Date    360 non-null    object
dtypes: int64(3), object(1)
memory usage: 11.4+ KB

In [60]:
before_year_list.head()

   Year  Month  Day        Date
0  1850      1   15  1850-01-15
1  1850      2   15  1850-02-15
2  1850      3   15  1850-03-15
3  1850      4   15  1850-04-15
4  1850      5   15  1850-05-15

In [61]:
before_year_list = before_year_list[['Date']]
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    360 non-null    object
dtypes: object(1)
memory usage: 2.9+ KB

In [62]:
before_year_list.Date = pd.to_datetime(before_year_list.Date)
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    360 non-null    datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 2.9 KB

In [63]:
before_year_list.head()

        Date
0 1850-01-15
1 1850-02-15
2 1850-03-15
3 1850-04-15
4 1850-05-15

In [64]:
before_year_list.tail()

          Date
355 1879-08-15
356 1879-09-15
357 1879-10-15
358 1879-11-15
359 1879-12-15

In [65]:
before_year_list['Global_mean_sea_levels'] = sea_df.Global_mean_sea_levels.iloc[0]
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    360 non-null    datetime64[ns]
 1   Global_mean_sea_levels  360 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 5.8 KB

In [66]:
before_year_list.head()

        Date  Global_mean_sea_levels
0 1850-01-15                  -183.0
1 1850-02-15                  -183.0
2 1850-03-15                  -183.0
3 1850-04-15                  -183.0
4 1850-05-15                  -183.0

In [67]:
before_year_list.tail()

          Date  Global_mean_sea_levels
355 1879-08-15                  -183.0
356 1879-09-15                  -183.0
357 1879-10-15                  -183.0
358 1879-11-15                  -183.0
359 1879-12-15                  -183.0

In [68]:
sea_df.Date.max()

Timestamp('2013-12-15 00:00:00')

In [69]:
from datetime import date
from itertools import product

y = np.arange(2014,2021)
d = [15]
m = np.arange(1,13)
cols = ['Year','Month','Day']
after_year_list = pd.DataFrame(list(product(y, m, d)), columns=cols)

DATE = []
for y, m in zip(after_year_list.Year, after_year_list.Month):
    DATE.append(date(y, m, 15))


after_year_list['Date'] = DATE
after_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    84 non-null     int64
 1   Month   84 non-null     int64
 2   Day     84 non-null     int64
 3   Date    84 non-null     object
dtypes: int64(3), object(1)
memory usage: 2.8+ KB

In [70]:
after_year_list.head()

   Year  Month  Day        Date
0  2014      1   15  2014-01-15
1  2014      2   15  2014-02-15
2  2014      3   15  2014-03-15
3  2014      4   15  2014-04-15
4  2014      5   15  2014-05-15

In [71]:
after_year_list = after_year_list[['Date']]
after_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    84 non-null     object
dtypes: object(1)
memory usage: 800.0+ bytes

In [72]:
after_year_list.Date = pd.to_datetime(after_year_list.Date)
after_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    84 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 800.0 bytes

In [73]:
after_year_list.head()

        Date
0 2014-01-15
1 2014-02-15
2 2014-03-15
3 2014-04-15
4 2014-05-15

In [74]:
after_year_list.tail()

         Date
79 2020-08-15
80 2020-09-15
81 2020-10-15
82 2020-11-15
83 2020-12-15

In [75]:
sea_df.iloc[-1]

Date                      2013-12-15 00:00:00
Global_mean_sea_levels                   58.5
Name: 1607, dtype: object

In [76]:
after_year_list['Global_mean_sea_levels'] = sea_df.Global_mean_sea_levels.iloc[-1]
after_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    84 non-null     datetime64[ns]
 1   Global_mean_sea_levels  84 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 1.4 KB

In [77]:
after_year_list.head()

        Date  Global_mean_sea_levels
0 2014-01-15                    58.5
1 2014-02-15                    58.5
2 2014-03-15                    58.5
3 2014-04-15                    58.5
4 2014-05-15                    58.5

In [78]:
after_year_list.tail()

         Date  Global_mean_sea_levels
79 2020-08-15                    58.5
80 2020-09-15                    58.5
81 2020-10-15                    58.5
82 2020-11-15                    58.5
83 2020-12-15                    58.5

In [79]:
final = [before_year_list, sea_df, after_year_list]
final = pd.concat(final)
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2052 entries, 0 to 83
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    2052 non-null   datetime64[ns]
 1   Global_mean_sea_levels  2052 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 48.1 KB

In [80]:
final.reset_index(drop=True, inplace=True)

In [81]:
final.head()

        Date  Global_mean_sea_levels
0 1850-01-15                  -183.0
1 1850-02-15                  -183.0
2 1850-03-15                  -183.0
3 1850-04-15                  -183.0
4 1850-05-15                  -183.0

In [82]:
final.tail()

           Date  Global_mean_sea_levels
2047 2020-08-15                    58.5
2048 2020-09-15                    58.5
2049 2020-10-15                    58.5
2050 2020-11-15                    58.5
2051 2020-12-15                    58.5

In [83]:
final.iloc[1547]

Date                      1978-12-15 00:00:00
Global_mean_sea_levels                  -25.2
Name: 1547, dtype: object

In [84]:
final.iloc[1548]

Date                      1979-01-15 00:00:00
Global_mean_sea_levels                    -28
Name: 1548, dtype: object

In [85]:
final.iloc[1549]

Date                      1979-02-15 00:00:00
Global_mean_sea_levels                  -26.9
Name: 1549, dtype: object

In [86]:
final.iloc[1560]

Date                      1980-01-15 00:00:00
Global_mean_sea_levels                  -15.2
Name: 1560, dtype: object

In [91]:
final.to_csv(dataset_path + 'FINAL_SEA.csv', encoding='utf-8', index=False)

In [88]:
final.Date.dt.year.unique()

array([1850, 1851, 1852, 1853, 1854, 1855, 1856, 1857, 1858, 1859, 1860,
       1861, 1862, 1863, 1864, 1865, 1866, 1867, 1868, 1869, 1870, 1871,
       1872, 1873, 1874, 1875, 1876, 1877, 1878, 1879, 1880, 1881, 1882,
       1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890, 1891, 1892, 1893,
       1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1902, 1903, 1904,
       1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914, 1915,
       1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926,
       1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937,
       1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948,
       1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959,
       1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970,
       1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981,
       1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992,
       1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003,
       2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014,
       2015, 2016, 2017, 2018, 2019, 2020])

In [89]:
final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2052 entries, 0 to 2051
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    2052 non-null   datetime64[ns]
 1   Global_mean_sea_levels  2052 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 32.2 KB